; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v3 ?v5)
             (pred_10 ?v8 ?v6)
             (pred_7 ?v3 ?v6)
             (pred_11 ?v1 ?v3 )
	     (pred_1 ?v3)
             (pred_5 ?v10)
             (pred_12 ?v8)
             (pred_6 ?v6)
             (pred_9 ?v3)
             (pred_4 ?v8)
             (pred_8 ?v3)
             (pred_2 ))



(:action op_3
:parameters (?v12 ?v9 ?v7 ?v2)
:precondition (and (pred_5 ?v12) (pred_5 ?v9) (pred_12 ?v7) (pred_6 ?v2)
          (pred_3 ?v12 ?v9) (pred_10 ?v7 ?v2)
                   (pred_7 ?v9 ?v2) (pred_1 ?v12) 
                   (pred_9 ?v9) (pred_4 ?v7))
:effect (and  (pred_8 ?v9) (not (pred_9 ?v9))))


(:action op_5
:parameters (?v12 ?v13)
:precondition (and (pred_5 ?v12) (pred_5 ?v13)
               (pred_1 ?v12) (pred_3 ?v12 ?v13) (pred_8 ?v13))
:effect (and (pred_1 ?v13) (not (pred_1 ?v12))))

(:action op_4
:parameters (?v12 ?v7)
:precondition (and (pred_5 ?v12) (pred_12 ?v7) 
                  (pred_1 ?v12) (pred_11 ?v7 ?v12) (pred_2 ))
:effect (and (pred_4 ?v7)
   (not (pred_11 ?v7 ?v12)) (not (pred_2 ))))


(:action op_1
:parameters (?v12 ?v4 ?v11)
:precondition (and (pred_5 ?v12) (pred_12 ?v4) (pred_12 ?v11)
                  (pred_1 ?v12) (pred_4 ?v11) (pred_11 ?v4 ?v12))
:effect (and (pred_4 ?v4) (pred_11 ?v11 ?v12)
        (not (pred_4 ?v11)) (not (pred_11 ?v4 ?v12))))

(:action op_2
:parameters (?v12 ?v7)
:precondition (and (pred_5 ?v12) (pred_12 ?v7) 
                  (pred_1 ?v12) (pred_4 ?v7))
:effect (and (pred_2 ) (pred_11 ?v7 ?v12) (not (pred_4 ?v7)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_08 obj_06 obj_12 obj_10 obj_27 obj_24 obj_25 obj_02 obj_09 obj_03 obj_21 obj_19 obj_15 obj_26 obj_07 obj_23 obj_30 obj_18 obj_04 obj_20 obj_28 obj_22 obj_11 obj_29
    obj_17 obj_01
    obj_05 obj_13 obj_14
    )

    (:init
       (pred_2)

       (pred_5 obj_16)
       (pred_5 obj_08)
       (pred_5 obj_06)
       (pred_5 obj_12)
       (pred_5 obj_10)
       (pred_5 obj_27)
       (pred_5 obj_24)
       (pred_5 obj_25)
       (pred_5 obj_02)
       (pred_5 obj_09)
       (pred_5 obj_03)
       (pred_5 obj_21)
       (pred_5 obj_19)
       (pred_5 obj_15)
       (pred_5 obj_26)
       (pred_5 obj_07)
       (pred_5 obj_23)
       (pred_5 obj_30)
       (pred_5 obj_18)
       (pred_5 obj_04)
       (pred_5 obj_20)
       (pred_5 obj_28)
       (pred_5 obj_22)
       (pred_5 obj_11)
       (pred_5 obj_29)
       (pred_6 obj_17)
       (pred_6 obj_01)
       (pred_12 obj_05)
       (pred_12 obj_13)
       (pred_12 obj_14)

       (pred_3 obj_16 obj_27)
       (pred_3 obj_16 obj_08)
       (pred_3 obj_08 obj_24)
       (pred_3 obj_08 obj_06)
       (pred_3 obj_08 obj_16)
       (pred_3 obj_06 obj_25)
       (pred_3 obj_06 obj_12)
       (pred_3 obj_06 obj_08)
       (pred_3 obj_12 obj_02)
       (pred_3 obj_12 obj_10)
       (pred_3 obj_12 obj_06)
       (pred_3 obj_10 obj_09)
       (pred_3 obj_10 obj_12)
       (pred_3 obj_27 obj_03)
       (pred_3 obj_27 obj_24)
       (pred_3 obj_27 obj_16)
       (pred_3 obj_24 obj_21)
       (pred_3 obj_24 obj_25)
       (pred_3 obj_24 obj_08)
       (pred_3 obj_24 obj_27)
       (pred_3 obj_25 obj_19)
       (pred_3 obj_25 obj_02)
       (pred_3 obj_25 obj_06)
       (pred_3 obj_25 obj_24)
       (pred_3 obj_02 obj_15)
       (pred_3 obj_02 obj_09)
       (pred_3 obj_02 obj_12)
       (pred_3 obj_02 obj_25)
       (pred_3 obj_09 obj_26)
       (pred_3 obj_09 obj_10)
       (pred_3 obj_09 obj_02)
       (pred_3 obj_03 obj_07)
       (pred_3 obj_03 obj_21)
       (pred_3 obj_03 obj_27)
       (pred_3 obj_21 obj_23)
       (pred_3 obj_21 obj_19)
       (pred_3 obj_21 obj_24)
       (pred_3 obj_21 obj_03)
       (pred_3 obj_19 obj_30)
       (pred_3 obj_19 obj_15)
       (pred_3 obj_19 obj_25)
       (pred_3 obj_19 obj_21)
       (pred_3 obj_15 obj_18)
       (pred_3 obj_15 obj_26)
       (pred_3 obj_15 obj_02)
       (pred_3 obj_15 obj_19)
       (pred_3 obj_26 obj_04)
       (pred_3 obj_26 obj_09)
       (pred_3 obj_26 obj_15)
       (pred_3 obj_07 obj_20)
       (pred_3 obj_07 obj_23)
       (pred_3 obj_07 obj_03)
       (pred_3 obj_23 obj_28)
       (pred_3 obj_23 obj_30)
       (pred_3 obj_23 obj_21)
       (pred_3 obj_23 obj_07)
       (pred_3 obj_30 obj_22)
       (pred_3 obj_30 obj_18)
       (pred_3 obj_30 obj_19)
       (pred_3 obj_30 obj_23)
       (pred_3 obj_18 obj_11)
       (pred_3 obj_18 obj_04)
       (pred_3 obj_18 obj_15)
       (pred_3 obj_18 obj_30)
       (pred_3 obj_04 obj_29)
       (pred_3 obj_04 obj_26)
       (pred_3 obj_04 obj_18)
       (pred_3 obj_20 obj_28)
       (pred_3 obj_20 obj_07)
       (pred_3 obj_28 obj_22)
       (pred_3 obj_28 obj_23)
       (pred_3 obj_28 obj_20)
       (pred_3 obj_22 obj_11)
       (pred_3 obj_22 obj_30)
       (pred_3 obj_22 obj_28)
       (pred_3 obj_11 obj_29)
       (pred_3 obj_11 obj_18)
       (pred_3 obj_11 obj_22)
       (pred_3 obj_29 obj_04)
       (pred_3 obj_29 obj_11)
       (pred_9 obj_02)
       (pred_9 obj_28)
       (pred_9 obj_29)
       (pred_7  obj_02 obj_17)
       (pred_7  obj_28 obj_01)
       (pred_7  obj_29 obj_17)
       (pred_8 obj_16)
       (pred_8 obj_08)
       (pred_8 obj_06)
       (pred_8 obj_12)
       (pred_8 obj_10)
       (pred_8 obj_27)
       (pred_8 obj_24)
       (pred_8 obj_25)
       (pred_8 obj_09)
       (pred_8 obj_03)
       (pred_8 obj_21)
       (pred_8 obj_19)
       (pred_8 obj_15)
       (pred_8 obj_26)
       (pred_8 obj_07)
       (pred_8 obj_23)
       (pred_8 obj_30)
       (pred_8 obj_18)
       (pred_8 obj_04)
       (pred_8 obj_20)
       (pred_8 obj_22)
       (pred_8 obj_11)

       (pred_10  obj_05 obj_17)
       (pred_10  obj_13 obj_01)
       (pred_10  obj_14 obj_01)
       (pred_11 obj_05 obj_06)
       (pred_11 obj_13 obj_30)
       (pred_11 obj_14 obj_15)
       (pred_1 obj_12)
    )

    (:goal (and
       (pred_11 obj_05 obj_23)
    ))
(:constraints
  (always (not (pred_1 obj_21)))
)
)

; plan
1. (op_5 obj_12 obj_06)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_06)
   goals met: 0 of 1
2. (op_4 obj_06 obj_05)
   deleted: (pred_11 obj_05 obj_06) (pred_2)
   added: (pred_4 obj_05)
   goals met: 0 of 1
3. (op_5 obj_06 obj_25)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_25)
   goals met: 0 of 1
4. (op_5 obj_25 obj_19)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_19)
   goals met: 0 of 1
5. (op_5 obj_19 obj_30)
   deleted: (pred_1 obj_19)
   added: (pred_1 obj_30)
   goals met: 0 of 1
6. (op_5 obj_30 obj_23)
   deleted: (pred_1 obj_30)
   added: (pred_1 obj_23)
   goals met: 0 of 1
7. (op_2 obj_23 obj_05)
   deleted: (pred_4 obj_05)
   added: (pred_2) (pred_11 obj_05 obj_23)
   goals met: 1 of 1
